InformationRegisters/Адреса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>Адреса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Километраж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодАдресногоОбъектаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодГородаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодНаселенногоПунктаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодРайона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГородВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АдресныйКлассификатор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>АдресныйКлассификатор</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сокращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АльтернативныеНазвания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПризнакАктуальности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипАдресногоЭлемента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодАдресногоОбъектаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодРайонаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодГородаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодНаселенногоПунктаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодУлицыВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>21</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ФормаВводаАдреса/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураАдреса = Новый Структура;
	
	СтруктураАдреса.Вставить("НаселенныйПункт","");
	СтруктураАдреса.Вставить("Улица","");
	СтруктураАдреса.Вставить("Дом","");
	СтруктураАдреса.Вставить("Подъезд","");
	СтруктураАдреса.Вставить("КодПодъезда","");
	СтруктураАдреса.Вставить("Этаж","");
	СтруктураАдреса.Вставить("Квартира","");
	
	//Разбираем старый адрес на сотовляющие и определяем город или населенный пункт
	Если ЗначениеЗаполнено(Параметры.СтарыйАдрес) Тогда
		
		СтруктураДляУлиц 	= Новый Структура;
		НаселенныйПункт 	= "";
		СтарыйАдрес 	 		= Параметры.СтарыйАдрес;
		СтарыйАдрес 	 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтарыйАдрес, ", ");
		
		СтруктураАдреса.Вставить("НаселенныйПункт", СтарыйАдрес[0]);
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("НаселенныйПункт", СтарыйАдрес[0]);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Адреса.КодАдресногоОбъектаВКоде,
		|	Адреса.КодГородаВКоде,
		|	Адреса.КодНаселенногоПунктаВКоде,
		|	Адреса.КодРайона
		|ИЗ
		|	РегистрСведений.Адреса КАК Адреса
		|ГДЕ
		|	Адреса.НаселенныйПункт = &НаселенныйПункт";
		Выборка = Запрос.Выполнить().Выбрать();
		
		Выборка.Следующий();
		СтруктураДляУлиц.Вставить("КодАдресногоОбъектаВКоде", Выборка.КодАдресногоОбъектаВКоде);
		СтруктураДляУлиц.Вставить("КодГородаВКоде", Выборка.КодГородаВКоде);
		СтруктураДляУлиц.Вставить("КодНаселенногоПунктаВКоде", Выборка.КодНаселенногоПунктаВКоде);
		СтруктураДляУлиц.Вставить("КодРайона", Выборка.КодРайона);
		СтруктураУлицИСокращений = ЗапроситьСписокУлиц(СтруктураДляУлиц);
		СтруктураАдреса.Вставить("СписокУлиц", СтруктураУлицИСокращений.СписокУлиц);
		Элементы.Улица.СписокВыбора.ЗагрузитьЗначения(СтруктураАдреса.СписокУлиц);
		
		МассивСокращений = СтруктураУлицИСокращений.Сокращения;
		
		Для каждого Элемент Из СтарыйАдрес Цикл
			
			Для каждого ЭлементМассива Из МассивСокращений Цикл
			
				СтруктураАдреса.Вставить("Улица", ?( Найти(Элемент, ЭлементМассива) > 0, Элемент,СтруктураАдреса.Улица));  //   СтрЗаменить( , ЭлементМассива,"")
			
			КонецЦикла;
			
			СтруктураАдреса.Вставить("Дом", ?( Найти(Элемент, "дом. ") > 0, СтрЗаменить(Элемент, "дом. ",""),СтруктураАдреса.Дом));
			СтруктураАдреса.Вставить("Подъезд", ?( Найти(Элемент, "подъезд. ") > 0, СтрЗаменить(Элемент, "подъезд. ",""),СтруктураАдреса.Подъезд));
			СтруктураАдреса.Вставить("КодПодъезда", ?( Найти(Элемент, "код подъезда. ") > 0, СтрЗаменить(Элемент, "код подъезда. ",""),СтруктураАдреса.КодПодъезда));
			СтруктураАдреса.Вставить("Этаж", ?( Найти(Элемент, "этаж. ") > 0, СтрЗаменить(Элемент, "этаж. ",""),СтруктураАдреса.Этаж));
			СтруктураАдреса.Вставить("Квартира", ?( Найти(Элемент, "кв. ") > 0, СтрЗаменить(Элемент, "кв. ",""),СтруктураАдреса.Квартира));
			
			НаселенныйПункт 	= СтруктураАдреса.НаселенныйПункт;
			Улица 					= СтруктураАдреса.Улица;
			Дом 						= СтруктураАдреса.Дом;
			Подъезд 				= СтруктураАдреса.Подъезд;
			КодПодъезда 			= СтруктураАдреса.КодПодъезда;
			Этаж 						= СтруктураАдреса.Этаж;
			Квартира 				= СтруктураАдреса.Квартира;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если Параметры.Свойство("Офис") Тогда
		
		ГородВладелец = Параметры.Офис.Город;
		
	ИначеЕсли Параметры.Свойство("Подразделение") Тогда
		
		ГородВладелец = Параметры.Подразделение.Город;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ГородВладелец", ГородВладелец);
	Запрос.УстановитьПараметр("НаселенныйПункт", НаселенныйПункт);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Адреса.Километраж
	|ИЗ
	|	РегистрСведений.Адреса КАК Адреса
	|ГДЕ
	|	Адреса.ГородВладелец = &ГородВладелец
	|	И Адреса.НаселенныйПункт = &НаселенныйПункт";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Километраж = Выборка.Километраж;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////
//// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

//////////////////////////////////////////////////////////////////////////////////
//// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Функция СформироватьАдрес()
	
	Адрес = "";
	//УлицаПереулок = " ул. ";    + УлицаПереулок
	Адрес = Адрес + НаселенныйПункт + ", " + Улица + "," + " дом. " + Дом + "," + ?(ЗначениеЗаполнено(Подъезд), " подъезд. " + Подъезд + ",", "") + 
	?(ЗначениеЗаполнено(КодПодъезда), " код подъезда. " + КодПодъезда + ",", "") + " этаж. " + Этаж + "," + ?(ЗначениеЗаполнено(Квартира), " кв. " + Квартира, "");
	
	ОтображениеАдреса = Адрес;
	
	Возврат Адрес;
	
КонецФункции // СформироватьАдрес()

&НаКлиенте
Процедура КомандаОКВыполнить()
	
	Если Этаж = 0 Тогда
		
		Этаж = 1;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НаселенныйПункт) Тогда
		
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю();
		Сообщение=Новый СообщениеПользователю();
		Сообщение.Текст="Не заполнен населенный пункт!";
		Сообщение.Поле="НаселенныйПункт";
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Улица) Тогда
		
		Сообщение=Новый СообщениеПользователю();
		Сообщение.Текст="Не заполнена улица!";
		Сообщение.Поле="Улица";
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Дом) Тогда
		
		Сообщение=Новый СообщениеПользователю();
		Сообщение.Текст="Не заполнен номер дома!";
		Сообщение.Поле="Дом";
		Сообщение.Сообщить();
		Возврат;	
		
	КонецЕсли;
	
	Адрес = "";
	Адрес = СформироватьАдрес();
	СтруктураПередачиАдреса = Новый Структура;
	СтруктураПередачиАдреса.Вставить("Адрес", Адрес);
	СтруктураПередачиАдреса.Вставить("Километраж", Километраж);
	
	Закрыть(СтруктураПередачиАдреса);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораНП(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПараметрыВыбора = Новый Структура;
	СтруктураНаселенногоПункта = Новый Структура;
	ПараметрыВыбора.Вставить("ГородВладелец", ГородВладелец);
	
	СтруктураНаселенногоПункта = ОткрытьФормуМодально("РегистрСведений.Адреса.Форма.ФормаВыбораНаселенногоПункта", ПараметрыВыбора, НаселенныйПункт);
	
	Если ТипЗнч(СтруктураНаселенногоПункта) = Тип("Структура") Тогда
		
		Улица 					= Неопределено;
		Дом 						= Неопределено;
		Подъезд 				= Неопределено;
		КодПодъезда 			= Неопределено;
		Этаж 						= Неопределено;
		Квартира 				= Неопределено;
		НаселенныйПункт	= СтруктураНаселенногоПункта.НаселенныйПункт;
		Километраж 			= СтруктураНаселенногоПункта.Километраж;
		
		СтруктураНаселенногоПункта.Вставить("СписокУлиц", ЗапроситьСписокУлиц(СтруктураНаселенногоПункта));
		Элементы.Улица.СписокВыбора.ЗагрузитьЗначения(СтруктураНаселенногоПункта.СписокУлиц.СписокУлиц);
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗапроситьСписокУлиц(СтруктураНаселенногоПункта)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТипАдресногоОбъектаВКоде", 5);
	Запрос.УстановитьПараметр("КодАдресногоОбъектаВКоде", СтруктураНаселенногоПункта.КодАдресногоОбъектаВКоде);
	Запрос.УстановитьПараметр("КодГородаВКоде", СтруктураНаселенногоПункта.КодГородаВКоде);
	Запрос.УстановитьПараметр("КодНаселенногоПунктаВКоде", СтруктураНаселенногоПункта.КодНаселенногоПунктаВКоде);
	Запрос.УстановитьПараметр("КодРайонаВКоде", СтруктураНаселенногоПункта.КодРайона);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АдресныйКлассификатор.Наименование КАК Наименование,
	|	"" "" + АдресныйКлассификатор.Сокращение + "". "" + АдресныйКлассификатор.Наименование КАК ПолноеНаименование
	|ИЗ
	|	РегистрСведений.АдресныйКлассификатор КАК АдресныйКлассификатор
	|ГДЕ
	|	АдресныйКлассификатор.ТипАдресногоЭлемента = 5
	|	И АдресныйКлассификатор.КодАдресногоОбъектаВКоде = &КодАдресногоОбъектаВКоде
	|	И АдресныйКлассификатор.КодГородаВКоде = &КодГородаВКоде
	|	И АдресныйКлассификатор.КодНаселенногоПунктаВКоде = &КодНаселенногоПунктаВКоде
	|	И АдресныйКлассификатор.КодРайонаВКоде = &КодРайонаВКоде
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АдресныйКлассификатор.Сокращение + "". "" КАК Сокращение
	|ИЗ
	|	РегистрСведений.АдресныйКлассификатор КАК АдресныйКлассификатор
	|ГДЕ
	|	АдресныйКлассификатор.ТипАдресногоЭлемента = 5
	|	И АдресныйКлассификатор.КодАдресногоОбъектаВКоде = &КодАдресногоОбъектаВКоде
	|	И АдресныйКлассификатор.КодГородаВКоде = &КодГородаВКоде
	|	И АдресныйКлассификатор.КодНаселенногоПунктаВКоде = &КодНаселенногоПунктаВКоде
	|	И АдресныйКлассификатор.КодРайонаВКоде = &КодРайонаВКоде
	|
	|СГРУППИРОВАТЬ ПО
	|	АдресныйКлассификатор.Сокращение + "". ""
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сокращение";
	
	МассивРезультаттов = Запрос.ВыполнитьПакет();
	СписокУлиц = МассивРезультаттов[0].Выгрузить().ВыгрузитьКолонку("ПолноеНаименование");
	Сокращения = МассивРезультаттов[1].Выгрузить().ВыгрузитьКолонку("Сокращение");
	Структурка = Новый Структура;
	Структурка.Вставить("СписокУлиц", СписокУлиц);
	Структурка.Вставить("Сокращения", Сокращения);
	
	Возврат Структурка;
	
	//Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПолноеНаименование");    //  Наименование
	
КонецФункции // ЗапроситьСписокУлиц()

&НаКлиенте
Процедура УлицаАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Ожидание 			 = 2; 
	Список 				 = Новый СписокЗначений;
	
	Если ТипЗнч(СтруктураНаселенногоПункта) = Тип("Структура") Тогда
		
		Массив 						= СтруктураНаселенногоПункта.СписокУлиц;
		ДлинаТекста 				= СтрДлина(Текст);
		МассивПодставляемыхЗначений = Новый Массив;
		
		Для каждого Значение Из Массив Цикл
			
			СравнивоемоеЗначение = Лев(Значение, ДлинаТекста);
			
			Если Текст = СравнивоемоеЗначение Тогда
				
				МассивПодставляемыхЗначений.Добавить(Значение); 
				
			КонецЕсли;
			
		КонецЦикла;
		
		Список.ЗагрузитьЗначения(МассивПодставляемыхЗначений);
		
		ДанныеВыбора = Список;
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаселенныйПунктПриИзменении(Элемент)
	
	Модифицированность = Истина;
	СформироватьАдрес();
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	
	СформироватьАдрес();
	
КонецПроцедуры

&НаКлиенте
Процедура ДомПриИзменении(Элемент)
	
	СформироватьАдрес();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодъездПриИзменении(Элемент)
	
	СформироватьАдрес();
	
КонецПроцедуры

&НаКлиенте
Процедура КодПодъездаПриИзменении(Элемент)
	
	СформироватьАдрес();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтажПриИзменении(Элемент)
	
	СформироватьАдрес();
	
КонецПроцедуры

&НаКлиенте
Процедура КвартираПриИзменении(Элемент)
	
	СформироватьАдрес();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СформироватьАдрес();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	НаселенныйПункт = Неопределено;
	Улица 			= Неопределено;
	Дом 			= Неопределено;
	Подъезд 		= Неопределено;
	КодПодъезда 	= Неопределено;
	Этаж 			= Неопределено;
	Квартира 		= Неопределено;
	Километраж 		= Неопределено;
	
	СформироватьАдрес();
	
КонецПроцедуры
